# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe'
brew 'svn'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'cowsay'
brew 'fortune'
brew 'figlet'
brew 'lolcat'
brew 'tmux'

# Development
brew 'php'
brew 'php@7.4'
brew 'php@7.3'
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'memcached'
brew 'mysql'
brew 'httpd'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask 'alfred'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'insomnia'
cask 'phpstorm'
cask 'slack'
# cask 'tableplus' - Disabled because of SetApp subscription
cask 'visual-studio-code'
cask 'flux'
cask 'messenger'
cask 'signal'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'